OpenFOAM_Benchmarks/LARC_Benchmarks/2DFDC/Coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack//b2-symmetry_y_strong
    {
        type            empty;
        nFaces          320;
        startFace       598;
    }
    frontAndBack///b3-symmetry_y_strong
    {
        type            empty;
        nFaces          320;
        startFace       918;
    }
    inlet//b4-subsonic_inflow_pt
    {
        type            patch;
        nFaces          32;
        startFace       1238;
    }
    outlet//b5-back_pressure
    {
        type            patch;
        nFaces          32;
        startFace       1270;
    }
    bottom//b6-viscous_solid
    {
        type            wall;
        nFaces          10;
        startFace       1302;
    }
    top//b7-viscous_solid
    {
        type            wall;
        nFaces          10;
        startFace       1312;
    }
)

// ************************************************************************* //
